IDEA StatiCa Open Model
Material.UserThermalStressStrainCurvature Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 User-defined curvature for thermal stress,strain { Temperature = Θ[K], {x = ε[-], y = σ[Pa]}}
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<TemperatureCurve2D> UserThermalStressStrainCurvature { get; set; }
Public Property UserThermalStressStrainCurvature As List(Of TemperatureCurve2D)
	Get
	Set
public:
property List<TemperatureCurve2D^>^ UserThermalStressStrainCurvature {
	List<TemperatureCurve2D^>^ get ();
	void set (List<TemperatureCurve2D^>^ value);
}
Property Value
Type: List<TemperatureCurve2D>
See Also
Reference
Material Class
IdeaRS.OpenModel.Material Namespace